import telebot
from datetime import date
import datetime
bot = telebot.TeleBot('1053910400:AAE9SoxN5rSeA11n09ZAJ9tC_nYxTh04n4w')
today=datetime.datetime.now()
wd=date.weekday(today)
days= ["Понедельник","Вторник","Среда","Четверг","Пятница","Субота","Воскресенье"]
@bot.message_handler(commands=['start'])
def start_message(message):
    bot.send_message(message.chat.id, 'Привет, сегодня '+ days[wd])
    print("which is a " + days[wd])
    if days[wd] == 'Понедельник':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.Физика 9.00-9.45
2.Технологии 9.55-10.40
3.Зарубежная литература 11.00-11.45
4.Геометрия 12.05-12.50
5.Украинский язык 13.10-13.55
6.Английский язык 14.05-14.50
7.Консультация ДПА математика 14.55-15.40''')
    if days[wd] == 'Вторник':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.История Украины 9.00-9.45
2.Физика 9.55-10.40
3.Украинский язык 11.00-11.45
4.Алгебра 12.05-12.50
5.Искусство 13.10-13.55
6.Биология 14.05-14.50
7.Физкультура 14.55-15.40''')
    if days[wd] == 'Среда':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.Физика 9.00-9.45
2.Химия 9.55-10.40
3.Биология 11.00-11.45
4.Геометрия 12.05-12.50
5.Украинский язык 13.10-13.55
6.История мира 14.05-14.50
7.Правознавство 14.55-15.40
8.Информатика 15.45-16.30''')
    if days[wd] == 'Четверг':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.Основы здоров`я 9.00-9.45
2.Украинский язык 9.55-10.40
3.Физкультура 11.00-11.45
4.География 12.05-12.50
5.Алгебра 13.10-13.55
6.Английский язык 14.05-14.50
7.Зарубежная литература 14.55-15.40
8.Информатика 15.45-16.30''')
    if days[wd] == 'Пятница':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.История украины 9.00-9.45
2.Украинская литература 9.55-10.40
3.Химия 11.00-11.45
4.Украинская литература 13.10-13.55
5.Биология 14.05-14.50
6.Физкультура 14.55-15.40
7.Музыка''')
    if days[wd] == 'Субота':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
СПАТЬ,ЕСТЬ,ЛЕЖАТЬ''')
    if days[wd] == 'Воскресенье':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
СПАТЬ,ЕСТЬ,ЛЕЖАТЬ''')
@bot.message_handler(commands=['ls'])
def start_message(message):
    bot.send_message(message.chat.id, 'Привет, сегодня '+ days[wd])
    print("which is a " + days[wd])
    if days[wd] == 'Понедельник':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.Физика 9.00-9.45
2.Технологии 9.55-10.40
3.Зарубежная литература 11.00-11.45
4.Геометрия 12.05-12.50
5.Украинский язык 13.10-13.55
6.Английский язык 14.05-14.50
7.Консультация ДПА математика 14.55-15.40''')
    if days[wd] == 'Вторник':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.История Украины 9.00-9.45
2.Физика 9.55-10.40
3.Украинский язык 11.00-11.45
4.Алгебра 12.05-12.50
5.Искусство 13.10-13.55
6.Биология 14.05-14.50
7.Физкультура 14.55-15.40''')
    if days[wd] == 'Среда':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.Физика 9.00-9.45
2.Химия 9.55-10.40
3.Биология 11.00-11.45
4.Геометрия 12.05-12.50
5.Украинский язык 13.10-13.55
6.История мира 14.05-14.50
7.Правознавство 14.55-15.40
8.Информатика 15.45-16.30''')
    if days[wd] == 'Четверг':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.Основы здоров`я 9.00-9.45
2.Украинский язык 9.55-10.40
3.Физкультура 11.00-11.45
4.География 12.05-12.50
5.Алгебра 13.10-13.55
6.Английский язык 14.05-14.50
7.Зарубежная литература 14.55-15.40
8.Информатика 15.45-16.30''')
    if days[wd] == 'Пятница':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
1.История украины 9.00-9.45
2.Украинская литература 9.55-10.40
3.Химия 11.00-11.45
4.Украинская литература 13.10-13.55
5.Биология 14.05-14.50
6.Физкультура 14.55-15.40
7.Музыка''')
    if days[wd] == 'Субота':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
СПАТЬ,ЕСТЬ,ЛЕЖАТЬ''')
    if days[wd] == 'Воскресенье':
        bot.send_message(message.chat.id,
'''Расписание на сегодня:
СПАТЬ,ЕСТЬ,ЛЕЖАТЬ''')

bot.polling()